Repository: Beans69584/rpg
Catalog: RPG/Resources/Strings.*.resx
Languages: es, fr

# MainMenu_Title
source: Demo RPG Game {0}
es: Juego RPG de Demostración {0}
fr: Jeu de RPG Démo {0}

# MainMenu_Start
source: Start New Game
es: Iniciar Nuevo Juego
fr: Démarrer une nouvelle partie

# MainMenu_Load
source: Load Game
es: Cargar Juego
fr: Charger une partie

# MainMenu_Options
source: Options
es: Opciones

# MainMenu_Credits
source: Credits
es: Créditos
fr: Crédits

# MainMenu_Exit
source: Exit Game
es: Salir del Juego
fr: Quitter le jeu

# Welcome_Message
source: Welcome to the Demo RPG Game!
es: ¡Bienvenido al Juego RPG de Demostración!
fr: Bienvenue dans le Jeu de RPG Démo !

# Help_Hint
source: Type 'help' for a list of commands.
es: Escribe 'help' para una lista de comandos.
fr: Tapez 'aide' pour une liste de commandes.

# MainMenu_NavigationHint
source: Use arrow keys to navigate and Enter to select
es: Usa las teclas de flecha para navegar y Enter para seleccionar
fr: Utilisez les touches fléchées pour naviguer et Entrée pour sélectionner

# MainMenu_Copyright
source: Â© {0} Demo RPG Game - All rights reserved
es: © {0} Juego RPG de Demostración - Todos los derechos reservados
fr: © {0} Jeu de RPG Démo - Tous droits réservés

# MainMenu_CreatedFor
source: Created for educational purposes
es: Creado con fines educativos
fr: Créé à des fins éducatives

# Options_Title
source: Options
es: Opciones

# Options_Instructions
source: Use Left/Right arrows to change language, Up/Down to navigate
es: Usa las flechas Izquierda/Derecha para cambiar el idioma, Arriba/Abajo para navegar
fr: Utilisez les flèches Gauche/Droite pour changer la langue, Haut/Bas pour naviguer

# Options_Language
source: Language
es: Idioma
fr: Langue

# Options_Back
source: Back
es: Volver
fr: Retour

# Error_WindowTooSmall
source: ERROR: Console window is too small!
es: ERROR: ¡La ventana de consola es demasiado pequeña!
fr: ERREUR : La fenêtre de la console est trop petite !

# Error_MinimumSize
source: Minimum size required: {0}x{1}
es: Tamaño mínimo requerido: {0}x{1}
fr: Taille minimale requise : {0}x{1}

# Error_CurrentSize
source: Current size: {0}x{1}
es: Tamaño actual: {0}x{1}
fr: Taille actuelle : {0}x{1}

# Error_ResizePrompt
source: Please resize your console window and press Enter to continue
es: Por favor, cambia el tamaño de tu ventana de consola y presiona Enter para continuar
fr: Veuillez redimensionner votre fenêtre de console et appuyer sur Entrée pour continuer

# Error_ExitPrompt
source: or press Escape to exit.
es: o presiona Escape para salir.
fr: ou appuyez sur Échap pour quitter.

# Error_ResizeTip
source: Tip: Try maximizing your console window.
es: Consejo: Intenta maximizar tu ventana de consola.
fr: Astuce : Essayez de maximiser votre fenêtre de console.

# Load_NoSaves
source: No saved games found.
es: No se encontraron partidas guardadas.
fr: Aucune partie enregistrée trouvée.

# Load_Title
source: Load Game
es: Cargar Juego
fr: Charger une partie

# Load_Instructions
source: Use Up/Down arrows to select a save, Enter to load, Escape to return
es: Usa las flechas Arriba/Abajo para seleccionar una partida, Enter para cargar, Escape para volver
fr: Utilisez les flèches Haut/Bas pour sélectionner une sauvegarde, Entrée pour charger, Échap pour revenir

# Load_ConfirmDelete
source: Are you sure you want to delete save {0}?
es: ¿Estás seguro de que deseas eliminar la partida {0}?
fr: Êtes-vous sûr de vouloir supprimer la sauvegarde {0} ?

# Load_DeleteInstructions
source: Press Delete to remove a save
es: Presiona Delete para eliminar una partida
fr: Appuyez sur Suppr pour supprimer une sauvegarde

# Load_DeleteWarning
source: This action cannot be undone!
es: ¡Esta acción no se puede deshacer!
fr: Cette action est irréversible !

# Settings_General
source: GENERAL SETTINGS
es: AJUSTES GENERALES
fr: PARAMÈTRES GÉNÉRAUX

# Settings_Visual
source: VISUAL SETTINGS
es: AJUSTES VISUALES
fr: PARAMÈTRES VISUELS

# Settings_Cursor
source: CURSOR SETTINGS
es: AJUSTES DEL CURSOR
fr: PARAMÈTRES DU CURSEUR

# Settings_Performance
source: PERFORMANCE
es: RENDIMIENTO

# Settings_Language_Label
source: Language: {0}
es: Idioma: {0}
fr: Langue : {0}

# Settings_Colors_Label
source: Colors: {0}
es: Colores: {0}
fr: Couleurs : {0}

# Settings_Colors_Toggle
source: Colors [Space to {0}]
es: Colores [Espacio para {0}]
fr: Couleurs [Espace pour {0}]

# Settings_BorderStyle_Label
source: Border Style: {0}
es: Estilo de Borde: {0}
fr: Style de bordure : {0}

# Settings_CursorBlink_Label
source: Cursor Blink: {0}
es: Parpadeo del Cursor: {0}
fr: Clignotement du curseur : {0}

# Settings_CursorBlink_Toggle
source: Cursor Blink [Space to {0}]
es: Parpadeo del Cursor [Espacio para {0}]
fr: Clignotement du curseur [Espace pour {0}]

# Settings_BlinkSpeed_Label
source: Blink Speed: {0}
es: Velocidad de Parpadeo: {0}
fr: Vitesse de clignotement : {0}

# Settings_FrameRate_Label
source: Frame Rate: {0} FPS
es: Tasa de Frames: {0} FPS
fr: Taux de rafraîchissement : {0} FPS

# Settings_NavigationHint
source: Arrow keys to navigate | Space/Enter to toggle | Esc to return
es: Flechas para navegar | Espacio/Enter para alternar | Esc para volver
fr: Touches fléchées pour naviguer | Espace/Entrée pour basculer | Échap pour revenir

# Common_On
source: On
es: Activado
fr: Activé

# Common_Off
source: Off
es: Desactivado
fr: Désactivé

# Common_Enable
source: enable
es: activar
fr: activer

# Common_Disable
source: disable
es: desactivar
fr: désactiver

# BorderStyle_Classic
source: Classic
es: Clásico
fr: Classique

# BorderStyle_Curved
source: Curved
es: Curvo
fr: Courbé

# BlinkSpeed_Fast
source: Fast
es: Rápido
fr: Rapide

# BlinkSpeed_Slow
source: Slow
es: Lento
fr: Lent

# BlinkSpeed_VerySlow
source: Very Slow
es: Muy Lento
fr: Très lent

# Load_Save_Auto
source: [Auto]
es: [Automático]

# Load_Character_Info
source: {0} - Level {1}
es: {0} - Nivel {1}
fr: {0} - Niveau {1}

# Load_PlayTime_Info
source: Play time: {0}
es: Tiempo de juego: {0}
fr: Temps de jeu : {0}

# Load_Page_Info
source: Page {0} of {1}
es: Página {0} de {1}
fr: Page {0} sur {1}

# Load_Page_Navigation
source: Use Left/Right arrows to navigate pages
es: Usa las flechas Izquierda/Derecha para navegar páginas
fr: Utilisez les flèches Gauche/Droite pour naviguer entre les pages

# GameLog_Title
source: Game Log
es: Registro del Juego
fr: Journal du jeu

# Stats_Title
source: Character Stats
es: Estadísticas del Personaje
fr: Statistiques du personnage

# Input_Title
source: Input
es: Entrada
fr: Entrée

# World_Generating
source: Generating new world...
es: Generando nuevo mundo...
fr: Génération du nouveau monde...

# World_Generated
source: Generated world '{0}' with {1} regions
es: Mundo generado '{0}' con {1} regiones
fr: Monde '{0}' généré avec {1} régions

# World_LoadError
source: Failed to load/generate world: {0}
es: Error al cargar/generar mundo: {0}
fr: Échec du chargement/génération du monde : {0}

# World_LoadErrorPrompt
source: Press any key to return to menu...
es: Presiona cualquier tecla para volver al menú...
fr: Appuyez sur une touche pour revenir au menu...

# Load_SaveError
source: Failed to load save: {0}
es: Error al cargar la partida: {0}
fr: Échec du chargement de la sauvegarde : {0}

# Load_PressKeyToReturn
source: Press any key to return...
es: Presiona cualquier tecla para regresar...
fr: Appuyez sur une touche pour revenir...

# MainMenu_AvailableSaves
source: Available Saves:
es: Partidas Disponibles:
fr: Sauvegardes disponibles :

# Settings_On
source: On
es: Activado
fr: Activé

# Settings_Off
source: Off
es: Desactivado
fr: Désactivé

# Settings_Enable
source: enable
es: activar
fr: activer

# Settings_Disable
source: disable
es: desactivar
fr: désactiver

# Settings_BackToMainMenu
source: Back to Main Menu
es: Volver al Menú Principal
fr: Retour au menu principal

# Load_PlayTime
source: Play time: {0}
es: Tiempo de juego: {0}
fr: Temps de jeu : {0}

# Error_Title
source: Error
fr: Erreur

# Load_Save_Manual
source: [Manual]
fr: [Manuel]

# PlayTime_Days
source: {0}d {1}h {2}m
fr: {0}j {1}h {2}m
