Repository: Beans69584/rpg
Catalog: Resources/Strings.*.resx
Languages: de, it, ja, ko, ru, zh

# MainMenu_Title
source: Demo RPG Game {0}
de: Demo RPG Spiel {0}
it: Gioco RPG Demo {0}
ja: デモRPGゲーム {0}
ko: 데모 RPG 게임 {0}
ru: Демо RPG Игра {0}
zh: 示例RPG游戏 {0}

# MainMenu_Start
source: Start New Game
de: Neues Spiel
it: Nuova Partita
ja: 新規ゲーム
ko: 새 게임
ru: Новая игра
zh: 开始新游戏

# MainMenu_Load
source: Load Game
de: Spiel laden
it: Carica Partita
ja: ロード
ko: 불러오기
ru: Загрузить игру
zh: 读取游戏

# MainMenu_Options
source: Options
de: Optionen
it: Opzioni
ja: 設定
ko: 설정
ru: Настройки
zh: 选项

# MainMenu_Exit
source: Exit Game
de: Beenden
it: Esci
ja: 終了
ko: 종료
ru: Выход
zh: 退出

# Welcome_Message
source: Welcome to the Demo RPG Game!
de: Willkommen beim Demo RPG Spiel!
it: Benvenuto nel Gioco RPG Demo!
ja: デモRPGゲームへようこそ！
ko: 데모 RPG 게임에 오신 것을 환영합니다!
ru: Добро пожаловать в Демо RPG Игру!
zh: 欢迎来到示例RPG游戏！

# Help_Hint
source: Type 'help' for a list of commands.
de: Geben Sie 'hilfe' ein für eine Liste der Befehle.
it: Digita 'aiuto' per la lista dei comandi.
ja: コマンド一覧を見るには「ヘルプ」と入力してください。
ko: 명령어 목록을 보려면 '도움말'을 입력하세요.
ru: Введите 'помощь' для списка команд.
zh: 输入'帮助'查看命令列表。

# MainMenu_NavigationHint
source: Use arrow keys to navigate and Enter to select
de: Pfeiltasten zur Navigation und Enter zum Auswählen
it: Usa le frecce per navigare e Invio per selezionare
ja: 矢印キーで移動、Enterで選択
ko: 방향키로 이동하고 Enter로 선택하세요
ru: Используйте стрелки для навигации и Enter для выбора
zh: 使用方向键导航，回车键选择

# MainMenu_Copyright
source: Â© {0} Demo RPG Game - All rights reserved
de: © {0} Demo RPG Spiel - Alle Rechte vorbehalten
it: © {0} Gioco RPG Demo - Tutti i diritti riservati
ja: © {0} デモRPGゲーム - All rights reserved
ko: © {0} 데모 RPG 게임 - 모든 권리 보유
ru: © {0} Демо RPG Игра - Все права защищены
zh: © {0} 示例RPG游戏 - 版权所有

# MainMenu_CreatedFor
source: Created for educational purposes
de: Erstellt für Bildungszwecke
it: Creato per scopi educativi
ja: 教育目的で作成
ko: 교육 목적으로 제작됨
ru: Создано в образовательных целях
zh: 为教育目的而创建

# Options_Title
source: Options
de: Optionen
it: Opzioni
ja: 設定
ko: 설정
ru: Настройки
zh: 选项

# Options_Instructions
source: Use Left/Right arrows to change language, Up/Down to navigate
de: Links/Rechts zum Sprachwechsel, Auf/Ab zur Navigation
it: Usa le frecce Sinistra/Destra per cambiare lingua, Su/Giù per navigare
ja: 左右矢印で言語変更、上下矢印で移動
ko: 좌/우 방향키로 언어 변경, 위/아래로 이동
ru: Используйте стрелки Влево/Вправо для смены языка, Вверх/Вниз для навигации
zh: 使用左/右方向键切换语言，上/下方向键导航

# Options_Language
source: Language
de: Sprache
it: Lingua
ja: 言語
ko: 언어
ru: Язык
zh: 语言

# Options_Back
source: Back
de: Zurück
it: Indietro
ja: 戻る
ko: 뒤로
ru: Назад
zh: 返回

# Error_Title
source: Error
de: Fehler
it: Errore
ja: エラー
ko: 오류
ru: Ошибка
zh: 错误

# Error_WindowTooSmall
source: ERROR: Console window is too small!
de: FEHLER: Konsolenfenster ist zu klein!
it: ERRORE: La finestra della console è troppo piccola!
ja: エラー：コンソールウィンドウが小さすぎます！
ko: 오류: 콘솔 창이 너무 작습니다!
ru: ОШИБКА: Окно консоли слишком маленькое!
zh: 错误：控制台窗口太小！

# Error_MinimumSize
source: Minimum size required: {0}x{1}
de: Minimale Größe erforderlich: {0}x{1}
it: Dimensione minima richiesta: {0}x{1}
ja: 必要最小サイズ：{0}x{1}
ko: 최소 필요 크기: {0}x{1}
ru: Минимальный размер: {0}x{1}
zh: 所需最小尺寸：{0}x{1}

# Error_CurrentSize
source: Current size: {0}x{1}
de: Aktuelle Größe: {0}x{1}
it: Dimensione attuale: {0}x{1}
ja: 現在のサイズ：{0}x{1}
ko: 현재 크기: {0}x{1}
ru: Текущий размер: {0}x{1}
zh: 当前尺寸：{0}x{1}

# Error_ResizePrompt
source: Please resize your console window and press Enter to continue
de: Bitte ändern Sie die Fenstergröße und drücken Sie Enter zum Fortfahren
it: Ridimensiona la finestra della console e premi Invio per continuare
ja: ウィンドウサイズを変更してEnterを押してください
ko: 콘솔 창 크기를 조절하고 Enter를 눌러 계속하세요
ru: Пожалуйста, измените размер окна консоли и нажмите Enter для продолжения
zh: 请调整控制台窗口大小并按回车键继续

# Error_ExitPrompt
source: or press Escape to exit.
de: oder drücken Sie Escape zum Beenden.
it: o premi Esc per uscire.
ja: または終了するにはEscapeを押してください。
ko: 또는 Escape를 눌러 종료하세요.
ru: или нажмите Escape для выхода.
zh: 或按Esc键退出。

# Error_ResizeTip
source: Tip: Try maximizing your console window.
de: Tipp: Versuchen Sie das Konsolenfenster zu maximieren.
it: Suggerimento: Prova a massimizzare la finestra della console.
ja: ヒント：コンソールウィンドウを最大化してみてください。
ko: 팁: 콘솔 창을 최대화해 보세요.
ru: Совет: Попробуйте развернуть окно консоли.
zh: 提示：尝试最大化控制台窗口。

# Load_NoSaves
source: No saved games found.
de: Keine Spielstände gefunden.

# Load_Title
source: Load Game
de: Spiel laden

# Load_Instructions
source: Use Up/Down arrows to select a save, Enter to load, Escape to return
de: Auf/Ab zur Auswahl, Enter zum Laden, Escape zum Zurückkehren

# Load_ConfirmDelete
source: Are you sure you want to delete save {0}?
de: Sind Sie sicher, dass Sie Spielstand {0} löschen möchten?

# Load_DeleteInstructions
source: Press Delete to remove a save
de: Drücken Sie Entf zum Löschen eines Spielstands

# Load_DeleteWarning
source: This action cannot be undone!
de: Diese Aktion kann nicht rückgängig gemacht werden!

# MainMenu_Credits
source: Credits
it: Crediti
ja: クレジット
ko: 크레딧
ru: Титры
zh: 制作人员
